mygamelife/SWD-for-ARM-Cortex-M4/FlashProgrammer/build/test/mocks/mock_stm32f4xx_hal_flash_ex.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32F4XX_HAL_FLASH_EX_H
#define _MOCK_STM32F4XX_HAL_FLASH_EX_H

#include "stm32f4xx_hal_flash_ex.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC)
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

void mock_stm32f4xx_hal_flash_ex_Init(void);
void mock_stm32f4xx_hal_flash_ex_Destroy(void);
void mock_stm32f4xx_hal_flash_ex_Verify(void);




#define HAL_FLASHEx_Erase_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_Erase_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_Erase_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_Erase_ExpectAndReturn(pEraseInit, SectorError, cmock_retval) HAL_FLASHEx_Erase_CMockExpectAndReturn(__LINE__, pEraseInit, SectorError, cmock_retval)
void HAL_FLASHEx_Erase_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FLASH_EraseInitTypeDef* pEraseInit, uint32_t* SectorError, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_Erase_CALLBACK)(FLASH_EraseInitTypeDef* pEraseInit, uint32_t* SectorError, int cmock_num_calls);
void HAL_FLASHEx_Erase_StubWithCallback(CMOCK_HAL_FLASHEx_Erase_CALLBACK Callback);
#define HAL_FLASHEx_Erase_IT_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_Erase_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_Erase_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_Erase_IT_ExpectAndReturn(pEraseInit, cmock_retval) HAL_FLASHEx_Erase_IT_CMockExpectAndReturn(__LINE__, pEraseInit, cmock_retval)
void HAL_FLASHEx_Erase_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FLASH_EraseInitTypeDef* pEraseInit, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_Erase_IT_CALLBACK)(FLASH_EraseInitTypeDef* pEraseInit, int cmock_num_calls);
void HAL_FLASHEx_Erase_IT_StubWithCallback(CMOCK_HAL_FLASHEx_Erase_IT_CALLBACK Callback);
#define HAL_FLASHEx_OBProgram_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_OBProgram_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OBProgram_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_OBProgram_ExpectAndReturn(pOBInit, cmock_retval) HAL_FLASHEx_OBProgram_CMockExpectAndReturn(__LINE__, pOBInit, cmock_retval)
void HAL_FLASHEx_OBProgram_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FLASH_OBProgramInitTypeDef* pOBInit, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_OBProgram_CALLBACK)(FLASH_OBProgramInitTypeDef* pOBInit, int cmock_num_calls);
void HAL_FLASHEx_OBProgram_StubWithCallback(CMOCK_HAL_FLASHEx_OBProgram_CALLBACK Callback);
#define HAL_FLASHEx_OBGetConfig_Ignore() HAL_FLASHEx_OBGetConfig_CMockIgnore()
void HAL_FLASHEx_OBGetConfig_CMockIgnore(void);
#define HAL_FLASHEx_OBGetConfig_Expect(pOBInit) HAL_FLASHEx_OBGetConfig_CMockExpect(__LINE__, pOBInit)
void HAL_FLASHEx_OBGetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, FLASH_OBProgramInitTypeDef* pOBInit);
typedef void (* CMOCK_HAL_FLASHEx_OBGetConfig_CALLBACK)(FLASH_OBProgramInitTypeDef* pOBInit, int cmock_num_calls);
void HAL_FLASHEx_OBGetConfig_StubWithCallback(CMOCK_HAL_FLASHEx_OBGetConfig_CALLBACK Callback);
#define HAL_FLASHEx_AdvOBProgram_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_AdvOBProgram_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_AdvOBProgram_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_AdvOBProgram_ExpectAndReturn(pAdvOBInit, cmock_retval) HAL_FLASHEx_AdvOBProgram_CMockExpectAndReturn(__LINE__, pAdvOBInit, cmock_retval)
void HAL_FLASHEx_AdvOBProgram_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, FLASH_AdvOBProgramInitTypeDef* pAdvOBInit, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_AdvOBProgram_CALLBACK)(FLASH_AdvOBProgramInitTypeDef* pAdvOBInit, int cmock_num_calls);
void HAL_FLASHEx_AdvOBProgram_StubWithCallback(CMOCK_HAL_FLASHEx_AdvOBProgram_CALLBACK Callback);
#define HAL_FLASHEx_AdvOBGetConfig_Ignore() HAL_FLASHEx_AdvOBGetConfig_CMockIgnore()
void HAL_FLASHEx_AdvOBGetConfig_CMockIgnore(void);
#define HAL_FLASHEx_AdvOBGetConfig_Expect(pAdvOBInit) HAL_FLASHEx_AdvOBGetConfig_CMockExpect(__LINE__, pAdvOBInit)
void HAL_FLASHEx_AdvOBGetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, FLASH_AdvOBProgramInitTypeDef* pAdvOBInit);
typedef void (* CMOCK_HAL_FLASHEx_AdvOBGetConfig_CALLBACK)(FLASH_AdvOBProgramInitTypeDef* pAdvOBInit, int cmock_num_calls);
void HAL_FLASHEx_AdvOBGetConfig_StubWithCallback(CMOCK_HAL_FLASHEx_AdvOBGetConfig_CALLBACK Callback);
#define HAL_FLASHEx_OB_SelectPCROP_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_OB_SelectPCROP_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_SelectPCROP_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_OB_SelectPCROP_ExpectAndReturn(cmock_retval) HAL_FLASHEx_OB_SelectPCROP_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_SelectPCROP_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_OB_SelectPCROP_CALLBACK)(int cmock_num_calls);
void HAL_FLASHEx_OB_SelectPCROP_StubWithCallback(CMOCK_HAL_FLASHEx_OB_SelectPCROP_CALLBACK Callback);
#define HAL_FLASHEx_OB_DeSelectPCROP_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_OB_DeSelectPCROP_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_DeSelectPCROP_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_FLASHEx_OB_DeSelectPCROP_ExpectAndReturn(cmock_retval) HAL_FLASHEx_OB_DeSelectPCROP_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_DeSelectPCROP_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_FLASHEx_OB_DeSelectPCROP_CALLBACK)(int cmock_num_calls);
void HAL_FLASHEx_OB_DeSelectPCROP_StubWithCallback(CMOCK_HAL_FLASHEx_OB_DeSelectPCROP_CALLBACK Callback);
#define HAL_FLASHEx_OB_GetBank2WRP_IgnoreAndReturn(cmock_retval) HAL_FLASHEx_OB_GetBank2WRP_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_GetBank2WRP_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint16_t cmock_to_return);
#define HAL_FLASHEx_OB_GetBank2WRP_ExpectAndReturn(cmock_retval) HAL_FLASHEx_OB_GetBank2WRP_CMockExpectAndReturn(__LINE__, cmock_retval)
void HAL_FLASHEx_OB_GetBank2WRP_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, uint16_t cmock_to_return);
typedef uint16_t (* CMOCK_HAL_FLASHEx_OB_GetBank2WRP_CALLBACK)(int cmock_num_calls);
void HAL_FLASHEx_OB_GetBank2WRP_StubWithCallback(CMOCK_HAL_FLASHEx_OB_GetBank2WRP_CALLBACK Callback);
#define FLASH_Erase_Sector_Ignore() FLASH_Erase_Sector_CMockIgnore()
void FLASH_Erase_Sector_CMockIgnore(void);
#define FLASH_Erase_Sector_Expect(Sector, VoltageRange) FLASH_Erase_Sector_CMockExpect(__LINE__, Sector, VoltageRange)
void FLASH_Erase_Sector_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t Sector, uint8_t VoltageRange);
typedef void (* CMOCK_FLASH_Erase_Sector_CALLBACK)(uint32_t Sector, uint8_t VoltageRange, int cmock_num_calls);
void FLASH_Erase_Sector_StubWithCallback(CMOCK_FLASH_Erase_Sector_CALLBACK Callback);

#endif
